/*

Завдання 2. Чому використовується клас, а чи не структура?
У C++ основна відмінність між class і struct полягає у доступі за замовчуванням:
- У класі члени за замовчуванням мають модифікатор private.
- У struct члени за замовчуванням мають модифікатор public.
Для класу Numbers зручно використовувати class, тому що дані потрібно приховати від прямого доступу та змінювати їх через методи set().

При цьому struct також дозволяє реалізувати інкапсуляцію: в ньому можна явно оголосити закриті поля за допомогою private.
Тому технічно обидва варіанти підходять, але class тут краще відповідає ідеї приховування даних.

*/